In [9]:
import pandas as pd

In [6]:
#dict withn a lest

table_1 = [
    {
        "Customer": "Hussain",
        "Product": "Phone",
        "Price": 200,
        "Quantity": 2
    },
    {
        "Customer": "Zahra",
        "Product": "Laptop",
        "Price": 500,
        "Quantity": 1
    },
    {
        "Customer": "Fatima",
        "Product": "Airpod",
        "Price": 150,
        "Quantity": 1
    },
    {
        "Customer": "Hassa",
        "Product": "Juice",
        "Price": 5,
        "Quantity": 20
    },
    {
        "Customer": "Mohamed",
        "Product": "Tea",
        "Price": 1,
        "Quantity": 5
    }
]

In [3]:
#list withen a dict

table_2 = {"customer": ["Husain", "Zahraa", "Fatema", "Hussain", "Mohammed"],
              "product": ["phone", "laptop", "airpod", "juice", "tea"],
              "Price": [200, 500, 150, 5, 1],
              "quantity": [2, 1, 1, 20, 5]}

In [25]:
import pandas as pd
df_table_2 = pd.DataFrame(table_2)

In [20]:
import pandas as pd
df_table_1 = pd.DataFrame(table_1)

In [26]:
print(df_table_1)
print(df_table_2)

   customer product  Price  quantity
0    Husain   phone    200         2
1    Zahraa  laptop    500         1
2    Fatema  airpod    150         1
3   Hussain   juice      5        20
4  Mohammed     tea      1         5
   customer product  Price  quantity
0    Husain   phone    200         2
1    Zahraa  laptop    500         1
2    Fatema  airpod    150         1
3   Hussain   juice      5        20
4  Mohammed     tea      1         5

In [27]:
type(table_1)

list

In [29]:
df_table_2[["customer","product"]]

   customer product
0    Husain   phone
1    Zahraa  laptop
2    Fatema  airpod
3   Hussain   juice
4  Mohammed     tea

In [44]:
df_table_2.iloc[0:2,]
df_table_2.iloc[0:2,:]
df_table_2.iloc[:2,3]

0    2
1    1
Name: quantity, dtype: int64

In [49]:
df_table_2.loc[:,"Price"]

0    200
1    500
2    150
3      5
4      1
Name: Price, dtype: int64

In [72]:
df_table_2.set_index("customer")

         product  Price  quantity
customer
Husain     phone    200         2
Zahraa    laptop    500         1
Fatema    airpod    150         1
Hussain    juice      5        20
Mohammed     tea      1         5

   customer product  Price  quantity
0    Husain   phone    200         2
1    Zahraa  laptop    500         1
2    Fatema  airpod    150         1
3   Hussain   juice      5        20
4  Mohammed     tea      1         5

In [86]:
print(df_table_2.shape)
print(type(df_table_2.shape))
#.no . row
print("no row",df_table_2.shape[0])

#no.clomns
print("no col",df_table_2.shape[1])

# nulls
print(f" no null:/n",df_table_2.isna())

print(f" no null:/n",df_table_2.isna().sum())

#duplicates

print(f" no dupl:/n",df_table_2.duplicated())
print(f" no dupl:/n",df_table_2.duplicated().sum())



d

(5, 4)
<class 'tuple'>
no row 5
no col 4
 no null:/n    customer  product  Price  quantity
0     False    False  False     False
1     False    False  False     False
2     False    False  False     False
3     False    False  False     False
4     False    False  False     False
 no null:/n customer    0
product     0
Price       0
quantity    0
dtype: int64
 no dupl:/n 0    False
1    False
2    False
3    False
4    False
dtype: bool
 no dupl:/n 0

In [89]:
df_table_2=df_table_2.reset_index()
#data type 
df_table_2.dtypes

#information 
df_table_2.info()

#basic stats

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   level_0   5 non-null      int64
 1   index     5 non-null      int64
 2   customer  5 non-null      object
 3   product   5 non-null      object
 4   Price     5 non-null      int64
 5   quantity  5 non-null      int64
dtypes: int64(4), object(2)
memory usage: 372.0+ bytes

In [119]:
df_table_2.columns

Index(['customer', 'product', 'Price', 'quantity'], dtype='object')

In [125]:

df_table_2.columns

Index(['customer', 'product', 'Price', 'quantity'], dtype='object')

In [113]:
df_table_2.index

RangeIndex(start=0, stop=5, step=1)

In [122]:
#basic stat 



df_table_2['Price'].mean()
df_table_2['Price'].median()
df_table_2['Price'].sum()
df_table_2['Price'].count()


df_table_2.describe()

summary = df_table_2.describe()

In [124]:

summary.loc["mean",:]

Price       171.2
quantity      5.8
Name: mean, dtype: float64

In [132]:
df_table_2.describe(include= "all")

       customer product       Price  quantity
count         5       5    5.000000       5.0
unique        5       5         NaN       4.0
top      Husain   phone         NaN       1.0
freq          1       1         NaN       2.0
mean        NaN     NaN  171.200000       NaN
std         NaN     NaN  203.702479       NaN
min         NaN     NaN    1.000000       NaN
25%         NaN     NaN    5.000000       NaN
50%         NaN     NaN  150.000000       NaN
75%         NaN     NaN  200.000000       NaN
max         NaN     NaN  500.000000       NaN

In [134]:
df_table_2["quantity"].astype("object")

0     2
1     1
2     1
3    20
4     5
Name: quantity, dtype: object

In [133]:
df_table_2["quantity"] = df_table_2["quantity"].astype("object")
df_table_2.dtypes

customer    object
product     object
Price        int64
quantity    object
dtype: object

In [135]:
df_table_2["quantity"] = df_table_2["quantity"].astype("int")
df_table_2.dtypes

customer    object
product     object
Price        int64
quantity     int32
dtype: object

In [137]:
df_table_2

   customer product  Price  quantity
0    Husain   phone    200         2
1    Zahraa  laptop    500         1
2    Fatema  airpod    150         1
3   Hussain   juice      5        20
4  Mohammed     tea      1         5

In [138]:
df_table_2.dtypes

customer    object
product     object
Price        int64
quantity     int32
dtype: object

In [139]:
df_table_2["sales"] = df_table_2["Price"] * df_table_2['quantity']
df_table_2

   customer product  Price  quantity  sales
0    Husain   phone    200         2    400
1    Zahraa  laptop    500         1    500
2    Fatema  airpod    150         1    150
3   Hussain   juice      5        20    100
4  Mohammed     tea      1         5      5

In [156]:
# create a new clomn to calculte the percentge (%) of sales 
# of each order 


df_table_2["sales per"] = (df_table_2["sales"] / df_table_2['sales'].sum()*100).astype("int")

df_table_2

   customer product  Price  quantity  sales  sales per
0    Husain   phone    200         2    400         34
1    Zahraa  laptop    500         1    500         43
2    Fatema  airpod    150         1    150         12
3   Hussain   juice      5        20    100          8
4  Mohammed     tea      1         5      5          0

In [176]:
#renaming columns
df_table_2=df_table_2.rename(columns={'Price':'PRICE','k':"SALES"}) 
df_table_2

   customer product  PRICE  quantity  SALES  sales per
0    Husain   phone    200         2    400         34
1    Zahraa  laptop    500         1    500         43
2    Fatema  airpod    150         1    150         12
3   Hussain   juice      5        20    100          8
4  Mohammed     tea      1         5      5          0

In [182]:
# count the values 
df_table_2['product'].value_counts()

product
phone     1
laptop    1
airpod    1
juice     1
tea       1
Name: count, dtype: int64

In [192]:
df_table_2 = df_table_2.sort_values(['SALES','quantity'], ascending= [False,False])
df_table_2

   customer product  PRICE  quantity  SALES  sales per
1    Zahraa  laptop    500         1    500         43
0    Husain   phone    200         2    400         34
2    Fatema  airpod    150         1    150         12
3   Hussain   juice      5        20    100          8
4  Mohammed     tea      1         5      5          0